/*Задача №7: Заправка машины на АЗС.На АЗС имеется четыре терминала. 
В одном из них можно заправиться только бензином(код топлива1),
во-втором - только дизельныи топливом(код топлива 2), в третьем - только газом (код топлива 3),
а в четвертом - любым из перечисленных видов топлива (код топлива 4). На АЗС приезжают одновременно 4 машины, 
коды используемого топлива которых К1 К2 К3 К4.
Могут ли одновременно заправляться на заправке четыре машины.
*/

#include <iostream>
using namespace std;

int main()
{
/*    int t, i = 0; // t - toplivo, n - кол-во машин

    while (i < 5) {
        i = i + 1;
        cout << "Car number: K" << i << endl;
        cout << "Toplivo car: ";
        cin >> t;
    }*/

}
